[
    {
        "titre": "Html",
        "image": "https://c4.wallpaperflare.com/wallpaper/887/817/276/html-5-html-5-logo-wallpaper-thumb.jpg",
        "resume": "cliquez pour en apprendre plus sur le html",
        "date": "octobre 2023",
        "descriptif": "Dans le cadre de ma formation en BTS SIO option SLAM, j’ai appris à maîtriser HTML, le langage de base pour structurer les pages web. Il permet d’organiser le contenu d’un site, comme le texte, les images ou les liens. Cette compétence m’a été indispensable pour mes premiers projets web, notamment lors de mes stages et de mon alternance, où j’ai souvent utilisé HTML en combinaison avec CSS et JavaScript pour créer des interfaces claires et fonctionnelles. C’est une base essentielle dans le développement web que j’utilise au quotidien.",
        "zoom": false
    },
    {
        "titre": "CSS",
        "image": "https://wallpapercave.com/wp/wp14758676.jpg",
        "resume": "cliquez pour en apprendre plus sur le css",
        "date": "octobre 2023",
        "descriptif": "Dans le cadre de mes projets web, j’ai appris à utiliser CSS (Cascading Style Sheets), un langage qui permet de gérer l’apparence et la mise en forme des pages HTML. Grâce à CSS, j’ai pu personnaliser l’interface utilisateur en agissant sur les couleurs, les polices, les marges ou encore les animations. C’est un outil indispensable pour rendre un site agréable, lisible et responsive. Au fil de ma formation et de mes expériences, j’ai appris à structurer mes feuilles de style de façon propre et réutilisable.",
        "zoom": false
    },
    {
        "titre": "php",
        "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi245WyLyYHxOUlH49A4tBLRfVSpjebThXzSkbj9IUTsLUK0OoMipARsDV3MfK3JmN3U39rWd0j9DpQF65O1O5pSlzDmxkLfOLcHH8KA8SS9FkqDy7nBQnoC_aWVo9pvRtmDmO02AQQ9KT0hqG77YTPsjkurwsyQcPbVtwvi4FiF1E6IVjQqEKdA3YkYupF/s750/4994252_6808_2.jpg",
        "resume": "cliquez pour en apprendre plus sur le php",
        "date": "octobre 2023",
        "descriptif": "J’ai également appris à développer avec PHP, un langage très utilisé pour créer des sites web dynamiques. Il permet de gérer la logique côté serveur, de traiter des formulaires, de manipuler des bases de données, ou encore de générer du contenu dynamique. J’ai utilisé PHP notamment pour développer des applications web complètes dans le cadre de mes projets en BTS SIO SLAM. Sa simplicité d’accès m’a permis de bien comprendre le fonctionnement des architectures web back-end.",
        "zoom": false
    },
    {
        "titre": "javascript",
        "image": "https://wallpapercave.com/wp/wp12454874.jpg",
        "resume": "cliquez pour en apprendre plus sur javascript",
        "date": "octobre 2023",
        "descriptif": "J’ai découvert JavaScript, un langage de programmation incontournable pour le développement web, lors de ma formation en BTS SIO SLAM. Il permet d’ajouter de l’interactivité aux pages web, comme des animations, des réactions aux actions de l’utilisateur ou la mise à jour dynamique du contenu. Cette base m’a ensuite permis d’approfondir mon apprentissage en alternance, en travaillant sur des projets concrets nécessitant la manipulation du DOM, la gestion des événements et la création de composants interactifs.",
        "zoom": false
    },
    {
        "titre": "clojure",
        "image": "https://arootroatch-blog.vercel.app/_next/image?url=%2Fimg%2Fclojure-banner.png&w=3840&q=5",
        "resume": "cliquez pour en apprendre plus sur clojure",
        "date": "mai 2024",
        "descriptif": "Durant mon alternance, j’ai été amené à utiliser Clojure et ClojureScript, deux langages fonctionnels basés sur Lisp. Clojure s’exécute sur la JVM, tandis que ClojureScript est destiné au développement front-end via JavaScript. Leur approche immuable et fonctionnelle m’a appris à penser autrement la conception d’applications, en privilégiant les fonctions pures, la clarté du code et la séparation des responsabilités. Ces langages m’ont permis de mieux structurer mes applications tout en découvrant un écosystème très différent des langages impératifs.",
        "zoom": false
    },
    {
        "titre": "react",
        "image": "https://hello-pomelo.com/wp-content/uploads/2024/01/react.png",
        "resume": "cliquez pour en apprendre plus sur react",
        "date": "décembre 2024",
        "descriptif": "J’ai découvert React en alternance, dans le cadre de projets web nécessitant des interfaces dynamiques et modulaires. Ce framework JavaScript, développé par Meta, permet de construire des applications en composants réutilisables, facilitant la gestion de l’interface et des données. Grâce à React, j’ai appris à structurer des interfaces complexes, à utiliser le Virtual DOM pour optimiser les performances, et à gérer efficacement l’état des applications avec des hooks comme useState et useEffect.",
        "zoom": false
    },
    {
        "titre": "svelte",
        "image": "https://miro.medium.com/v2/resize:fit:676/1*RITt6fMV2WpksJ8f1C2gVw.png",
        "resume": "cliquez pour en apprendre plus sur svelte",
        "date": "février 2025",
        "descriptif": "J’ai également eu l’occasion de travailler avec Svelte, un framework JavaScript moderne orienté performance et simplicité. Contrairement à React, Svelte compile les composants en JavaScript natif à la compilation, ce qui améliore la rapidité d’exécution. Son approche intuitive m’a permis de développer rapidement des interfaces fluides et légères, tout en gardant un code clair et concis. Svelte m’a apporté une nouvelle vision du développement front-end, axée sur l'efficacité et la facilité de maintenance.",
        "zoom": false
    },
    {
        "titre": "reframe/re-agent",
        "image": "https://i.vimeocdn.com/video/603160108-0b12a06a7ecbcf9b6b104a05df1f99cb909c0714fcb60af5bcac1a3349093354-d_640x360?r=pad",
        "resume": "cliquez pour en apprendre plus sur reframe et re-agent",
        "date": "mars2025",
        "descriptif": "Dans le cadre de projets front-end en ClojureScript, j’ai travaillé avec Reagent et re-frame, deux bibliothèques complémentaires. Reagent est une interface entre ClojureScript et React, qui permet de créer des composants réactifs avec une syntaxe simple et expressive. Re-frame, quant à lui, propose une architecture unidirectionnelle basée sur des événements, facilitant la gestion de l’état global de l’application. L’utilisation conjointe de ces outils m’a permis de construire des interfaces complexes de manière claire, modulaire et maintenable, en tirant parti des avantages de la programmation fonctionnelle.",
        "zoom": false
    }    
]